using System;
using System.Collections.Generic;
using System.Linq;

namespace BitDAO.Utils.Daoism;

public class DaoismUtils
{
    public static readonly string[] Zhi = ["子", "丑", "寅", "卯", "辰", "巳",
                                           "午", "未", "申", "酉", "戌", "亥"];

    public static readonly string[] Gan = ["甲", "乙", "丙", "丁", "戊",
                                           "己", "庚", "辛", "壬", "癸"];

    public static readonly string[] JiaZi = ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
                                             "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
                                             "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
                                             "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
                                             "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
                                             "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"];
    public static readonly string[] WuXing = ["木", "火", "土", "金", "水"];

    public static readonly Dictionary<string, string> GanWuXing = new()
    {
        {"甲", "木"}, {"乙", "木"}, {"丙", "火"}, {"丁", "火"}, {"戊", "土"},
        {"己", "土"}, {"庚", "金"}, {"辛", "金"}, {"壬", "水"}, {"癸", "水"}
    };

    public static readonly Dictionary<string, string> ZhiWuXing = new()
    {
        {"子", "水"}, {"丑", "土"}, {"寅", "木"}, {"卯", "木"}, {"辰", "土"}, {"巳", "火"},
        {"午", "火"}, {"未", "土"}, {"申", "金"}, {"酉", "金"}, {"戌", "土"}, {"亥", "水"},
    };

    public static readonly Dictionary<string, string[]> ZhiCangGan = new()
    {
        {"子", ["癸"]},
        {"丑", ["己", "癸", "辛"]},
        {"寅", ["甲", "丙", "戊"]},
        {"卯", ["乙"]},
        {"辰", ["戊", "乙", "癸"]},
        {"巳", ["丙", "庚", "戊"]},
        {"午", ["丁", "己"]},
        {"未", ["己", "丁", "乙"]},
        {"申", ["庚", "壬", "戊"]},
        {"酉", ["辛"]},
        {"戌", ["戊", "辛", "丁"]},
        {"亥", ["壬", "甲"]}
    };

    public static readonly Dictionary<string, string> NaYin = new()
    {
        {"甲子", "海中金"}, {"甲午", "沙中金"}, {"丙寅", "炉中火"}, {"丙申", "山下火"}, {"戊辰", "大林木"},
        {"戊戌", "平地木"}, {"庚午", "路旁土"}, {"庚子", "壁上土"}, {"壬申", "剑锋金"}, {"壬寅", "金箔金"},
        {"甲戌", "山头火"}, {"甲辰", "覆灯火"}, {"丙子", "涧下水"}, {"丙午", "天河水"}, {"戊寅", "城头土"},
        {"戊申", "大驿土"}, {"庚辰", "白蜡金"}, {"庚戌", "钗钏金"}, {"壬午", "杨柳木"}, {"壬子", "桑柘木"},
        {"甲申", "泉中水"}, {"甲寅", "大溪水"}, {"丙戌", "屋上土"}, {"丙辰", "沙中土"}, {"戊子", "霹雳火"},
        {"戊午", "天上火"}, {"庚寅", "松柏木"}, {"庚申", "石榴木"}, {"壬辰", "长流水"}, {"壬戌", "大海水"},
        {"乙丑", "海中金"}, {"乙未", "沙中金"}, {"丁卯", "炉中火"}, {"丁酉", "山下火"}, {"己巳", "大林木"},
        {"己亥", "平地木"}, {"辛未", "路旁土"}, {"辛丑", "壁上土"}, {"癸酉", "剑锋金"}, {"癸卯", "金箔金"},
        {"乙亥", "山头火"}, {"乙巳", "覆灯火"}, {"丁丑", "涧下水"}, {"丁未", "天河水"}, {"己卯", "城头土"},
        {"己酉", "大驿土"}, {"辛巳", "白蜡金"}, {"辛亥", "钗钏金"}, {"癸未", "杨柳木"}, {"癸丑", "桑柘木"},
        {"乙酉", "泉中水"}, {"乙卯", "大溪水"}, {"丁亥", "屋上土"}, {"丁巳", "沙中土"}, {"己丑", "霹雳火"},
        {"己未", "天上火"}, {"辛卯", "松柏木"}, {"辛酉", "石榴木"}, {"癸巳", "长流水"}, {"癸亥", "大海水"}
    };
    public static readonly Dictionary<string, string> ShiShen = new()
    {
        {"甲甲", "比肩"}, {"甲乙", "劫财"}, {"甲丙", "食神"}, {"甲丁", "伤官"}, {"甲戊", "偏财"},
        {"甲己", "正财"}, {"甲庚", "七杀"}, {"甲辛", "正官"}, {"甲壬", "偏印"}, {"甲癸", "正印"},
        {"乙乙", "比肩"}, {"乙甲", "劫财"}, {"乙丁", "食神"}, {"乙丙", "伤官"}, {"乙己", "偏财"},
        {"乙戊", "正财"}, {"乙辛", "七杀"}, {"乙庚", "正官"}, {"乙癸", "偏印"}, {"乙壬", "正印"},
        {"丙丙", "比肩"}, {"丙丁", "劫财"}, {"丙戊", "食神"}, {"丙己", "伤官"}, {"丙庚", "偏财"},
        {"丙辛", "正财"}, {"丙壬", "七杀"}, {"丙癸", "正官"}, {"丙甲", "偏印"}, {"丙乙", "正印"},
        {"丁丁", "比肩"}, {"丁丙", "劫财"}, {"丁己", "食神"}, {"丁戊", "伤官"}, {"丁辛", "偏财"},
        {"丁庚", "正财"}, {"丁癸", "七杀"}, {"丁壬", "正官"}, {"丁乙", "偏印"}, {"丁甲", "正印"},
        {"戊戊", "比肩"}, {"戊己", "劫财"}, {"戊庚", "食神"}, {"戊辛", "伤官"}, {"戊壬", "偏财"},
        {"戊癸", "正财"}, {"戊甲", "七杀"}, {"戊乙", "正官"}, {"戊丙", "偏印"}, {"戊丁", "正印"},
        {"己己", "比肩"}, {"己戊", "劫财"}, {"己辛", "食神"}, {"己庚", "伤官"}, {"己癸", "偏财"},
        {"己壬", "正财"}, {"己乙", "七杀"}, {"己甲", "正官"}, {"己丁", "偏印"}, {"己丙", "正印"},
        {"庚庚", "比肩"}, {"庚辛", "劫财"}, {"庚壬", "食神"}, {"庚癸", "伤官"}, {"庚甲", "偏财"},
        {"庚乙", "正财"}, {"庚丙", "七杀"}, {"庚丁", "正官"}, {"庚戊", "偏印"}, {"庚己", "正印"},
        {"辛辛", "比肩"}, {"辛庚", "劫财"}, {"辛癸", "食神"}, {"辛壬", "伤官"}, {"辛乙", "偏财"},
        {"辛甲", "正财"}, {"辛丁", "七杀"}, {"辛丙", "正官"}, {"辛己", "偏印"}, {"辛戊", "正印"},
        {"壬壬", "比肩"}, {"壬癸", "劫财"}, {"壬甲", "食神"}, {"壬乙", "伤官"}, {"壬丙", "偏财"},
        {"壬丁", "正财"}, {"壬戊", "七杀"}, {"壬己", "正官"}, {"壬庚", "偏印"}, {"壬辛", "正印"},
        {"癸癸", "比肩"}, {"癸壬", "劫财"}, {"癸乙", "食神"}, {"癸甲", "伤官"}, {"癸丁", "偏财"},
        {"癸丙", "正财"}, {"癸己", "七杀"}, {"癸戊", "正官"}, {"癸辛", "偏印"}, {"癸庚", "正印"}
    };

    public static readonly Dictionary<string, string[]> ZhiCangSiShen = new()
    {
        {"子", [ "癸" ]},
        {"丑", [ "己", "癸", "辛" ]},
        {"寅", [ "甲", "丙", "戊" ]},
        {"卯", [ "乙" ]},
        {"辰", [ "戊", "乙", "癸" ]},
        {"巳", [ "丙", "庚", "戊" ]},
        {"午", [ "丁", "己" ]},
        {"未", [ "己", "丁", "乙" ]},
        {"申", [ "庚", "壬", "戊" ]},
        {"酉", [ "辛" ]},
        {"戌", [ "戊", "辛", "丁" ]},
        {"亥", [ "壬", "甲" ]}
    };

    public static readonly string[] LiuQi = ["厥阴风木", "少阴君火", "太阴湿土",
                                             "少阳相火", "阳明燥金", "太阳寒水"];
    public static readonly string[] ZhangSheng = ["长生", "沐浴", "冠带", "临官",
                                                  "帝旺", "衰", "病", "死",
                                                  "墓", "绝", "胎", "养"];

    public static readonly string[] Xun = ["甲子", "甲戌", "甲申", "甲午", "甲辰", "甲寅"];

    public static readonly string[] XunKong = ["戌亥", "申酉", "午未", "辰巳", "寅卯", "子丑"];

    public static readonly Dictionary<string, string> WuHuDun = new()
    {
        {"甲", "丙"}, {"乙", "戊"}, {"丙", "庚"}, {"丁", "壬"}, {"戊", "甲"},
        {"己", "丙"}, {"庚", "戊"}, {"辛", "庚"}, {"壬", "壬"}, {"癸", "甲"}
    };


}
